ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/scalability/bpels/Ph2WaitInstancePassivation/deployedFolder/FunctionalTest2.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="FunctionalTest2" targetNamespace="http://j2ee.netbeans.org/wsdl/FunctionalTest2"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/FunctionalTest2" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="message1">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="receivePortType">
        <operation name="receiveOperation">
            <input name="input1" message="tns:message1"/>
        </operation>
    </portType>
    <portType name="invokePortType">
        <operation name="invokeOperation">
            <input name="input1" message="tns:message1"/>
            <output name="output1" message="tns:message1"/>
        </operation>
    </portType>
    <binding name="FunctionalTest2Binding" type="tns:receivePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="receiveOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/FunctionalTest2"/>
            </input>
        </operation>
    </binding>
    <service name="FunctionalTest2Service">
        <port name="receivePort" binding="tns:FunctionalTest2Binding">
            <soap:address location="http://localhost:18181/FunctionalTest2Service/FunctionalTest2Port"/>
        </port>
    </service>
    <plnk:partnerLinkType name="receivePLT">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="receivePortTypeRole" portType="tns:receivePortType"/>
    </plnk:partnerLinkType>
    <plnk:partnerLinkType name="invokePLT">
        <plnk:role name="role1" portType="tns:invokePortType"/>
    </plnk:partnerLinkType>
</definitions>
