ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/scalability/bpels/PendRespVarsPassivation/prj2Jbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fun="http://j2ee.netbeans.org/wsdl/FunctionalTest2">
  <soapenv:Body>
    <fun:receiveOperation>
      <part1>Input Message</part1>
    </fun:receiveOperation>
  </soapenv:Body>
</soapenv:Envelope>